{"Newsfeed_posts": ["\n\n\n Game changer. Open AI just released their own Prompt Engineering guide. Here is a summary of their 6 strategies for getting better results when prompting GPT:1. Write Clear Instructions:- Be specific: Clarity in instructions leads to more relevant outcomes.- Define the desired output length and complexity.- Demonstrate preferred formats.- Minimize ambiguity to enhance model accuracy.2. Provide Reference Text:- Counteract potential fabrications with concrete reference materials.- Reference texts guide the model towards accurate and reliable answers.3. Split Complex Tasks into Simpler Subtasks:- Break down tasks to reduce errors and improve manageability.- Consider tasks as workflows of simpler, interconnected steps.4. Give the Model Time to \"Think\":- Allow the model to process and reason, similar to a human solving a complex problem.- Encourage a \"chain of thought\" approach for more accurate reasoning.5. Use External Tools:- Supplement the model's capabilities with specialized tools for specific tasks.- Leverage resources like text retrieval systems or code execution engines.6. Test Changes Systematically:- Measure improvements with a comprehensive testing approach.- Ensure that modifications lead to overall performance enhancements.Full Guide: https://lnkd.in/gcQg3Pii↓Are you technical? Check out https://AlphaSignal.ai to get a weekly summary of the latest models, repos and papers in AI. Read by 150,000+ engineers and researchers.\n\n", "\n\n\n Every connection matters to this software engineer. From finding community to bringing data-driven projects together, Mark W. is passionate about empowering others to think differently. https://lnkd.in/gGvbbH8J hashtag#LifeatMeta hashtag#Connection hashtag#Data hashtag#SoftwareEngineer\n\n", "\n\n\n OpenAI delivered a double blow to Google. First, it created a tool that replaces googling in many scenarios surpassing it in quality of user experience. Second, it created a machine that pollutes Google's index with low-quality information while Google's main competitor, Bing, remains immune to this pollution due to the access to all ChatGPT-generated texts which gives it the ability to easily recognize these texts.2024 will be a hard year for Google. Gemini might become just another flop like Bard. Furthermore, I'm not sure it's even possible to replace the lost ad revenues with subscriptions to Gemini (assuming anyone would want to play for Gemini).\n\n", "\n\n\n I had a great time representing Weights & Biases at hashtag#NeurIPS2023, see below my key takeaways ❤️ \n\n", "\n\n\n Not the H-1B lottery results you were hoping for? Let MobSquad be your solution.  We help tech professionals continue working with their current company, nearshore from Canada.\n\n", "\n\n\n Low hanging fruit, but under-used: improve your data instead of your models.Most ML researchers and practitioners focus on increasing performance through small algorithmic improvements (the latest model, different prompts etc.). Data-centric methods instead focus on improving the training data for better performance and improving the test data to make metrics more meaningful. \"DataPerf: Benchmarks for Data-Centric AI Development\" is a very interesting hashtag#NeurIPS2023 paper with a focus on data-centric methods.If your ML team spends 80% of their time on algorithmic improvements, try and redirect just 20% of this time to improving your data and you will get much better improvements compared to only focussing on chasing the latest models. Otherwise: Garbage in, garbage out.Tools like Argilla or Cleanlab make this quite easy.Link to paper DataPerf paper: https://lnkd.in/eXTFnaHB\n\n", "\n\n\n We evaluated the content of 50+ online resources for learning Quant Finance and picked out the top 11 recommendations1) IIT Kanpur Quant Finance course by Professor Raghu Nandan - https://lnkd.in/dHewAfYc2) IIT Bombay, Stochastic Process course by Prof. Manjesh Hanawalhttps://lnkd.in/gRq6f-NJ3) MIT Financial Mathematics course - https://lnkd.in/gwmmyWrz4) Yale Univerity Quantitative Finance course - https://lnkd.in/gqGXFGeZ5) Mathematical Methods for Quantitative Finance - https://lnkd.in/gPTRQMdc6) IIT Guwahati - Mathematical Finance https://lnkd.in/gHwrzhEa7) Introduction to computer science and programming in Python - https://lnkd.in/gFX4XZPp8) Computational Finance by Leipzig University- https://lnkd.in/gHMkr8Ue9) IIT Kanpur Probability and Stochastics for Finance - by Professor Joydeep Dutta - https://lnkd.in/ggDJkVgE10) Harvard Applied Mathematics - https://lnkd.in/gzrYZ7Ne11) Harvard CS50 – Full Computer Science University Course - https://lnkd.in/gK9qVMQX (If you don't have a coding background) kickstart your Quant Interview PrepCheck out Quant Insider Stack - https://lnkd.in/gcfdUEfgA Bundle of Interview Byte, Quantopia Library, and Quant Insider Project Handbook with Bonus Resources.‘Interview Byte’ contains 1000+ Interview questions (https://lnkd.in/gkqcrrKf)Quantopia Library is the goldmine for building your domain knowledge and technical skills. (https://lnkd.in/geThBB4d)Quant Insider Project Handbook has 10 industry-oriented projects based on challenges and competitions conducted by Top HFTs and Hedge Funds.(https://lnkd.in/gWBEn78U)For more quant finance memes follow us on Instagram - Quant Insider (https://lnkd.in/gfjc4hBu)Connect with Quant Insider on other platforms as well https://lnkd.in/gpu4GKzE\n\n", "\n\n\n Artificial intelligence has taken the world by storm. NJIT's brand new graduate certificate in AI can power you to a rewarding career in business, advertising, finance, medicine, and many other fields.The demand for professionals who can design and implement complex AI systems has never been higher. Skill up now and secure your future at the NJIT's best-in-class computing department with our new graduate certificate in AI.\n\n", "\n\n\n If you have a coming data science or ML interview this series of articles will be helpful:➡ Machine Learning Interview Questions & Answers for Data ScientistsLink: https://lnkd.in/dQgjtg3W➡ Deep Learning Interview Questions & Answers for Data ScientistsLink: https://lnkd.in/d8s5xzFi➡ Top Large Language Models (LLMs) Interview Questions & AnswersLink: https://lnkd.in/gBaj9JRz➡ Top Computer Vision Interview Questions & Answers [Part 1]Link: https://lnkd.in/gBaj9JRz➡ Top Computer Vision Interview Questions & Answers [Part 2]Link: https://lnkd.in/dkdpSKY5➡ Top Computer Vision Interview Questions & Answers [Part 3]Link: https://lnkd.in/da4y6tNS➡ SQL & Database Interview Questions & Answers for Data ScientistsLink: https://lnkd.in/duk7tsKi➡ Top Important Python Questions for Data Science Interviews [Conceptual Questions]Link: https://lnkd.in/da4y6tNS➡ Statistics Interview Questions & Answers for Data ScientistsLink: https://lnkd.in/dxZ6AFGh➡ Probability Interview Questions & Answers for Data ScientistsLink: https://lnkd.in/dGcEJ7Rx⭐ You can find all of them in this Github Repository:https://lnkd.in/dGz_AsBM⭐ Subscribe to my newsletter To Data & Beyond to have full access to my past and future articles:https://lnkd.in/dVkD-7WT📒 My eBook Data Science Portfolio for Success: Your Ultimate Guide to Building a Data Science Portfolio:https://lnkd.in/ddaqcmt8\n\n", "\n\n\n Machine Learning w/ Python.Credit: Willi Richert & Luis Pedro Coelho\n\n", "\n\n\n Electrification, severe storms, and rising customer expectations are placing increasing strain on our power systems. Deploying modern technology and scaling automation solutions can transform the grid for an outage-free future.\n\n", "\n\n\n A highly important open question about AIs has been whether they can actually discover new things, rather than just recombine training data that they have learned from.Today, a new Nature paper has shown that LLMs can! A model \"discovered new solutions for the cap set problem, a longstanding open problem in mathematics\" https://lnkd.in/dUzk4Gsd\n\n", "\n\n\n The best way to learn to build software, is to build real software. 🏗 But often it’s hard to know what to build, so we end up spending time looking for ideas instead of building and learning.To help with that, I’ve been sharing a list of project ideas complete with steps to work through in my Coding Challenges newsletter.Here are some of the past challenges:⇢ Build your own Redis server - https://lnkd.in/eHRCAmCE⇢ Build your own URL shortener - https://lnkd.in/ezCc8EFR⇢ Build your own Application Load Balancer - https://lnkd.in/eiBRVHNu⇢ Build your own QR Code Generator - https://lnkd.in/erhe9zcy⇢ Build your own crontab tool - https://lnkd.in/ekwAMevc⇢ Build your own Lisp interpreter - https://lnkd.in/eR7Q28yM⇢ Build your own DNS Resolver - https://lnkd.in/eUB3nyxC⇢ Build your own Git Client - https://lnkd.in/eG6jYyRm⇢ Build your own Scheduling App - https://lnkd.in/eKDSRhdS⇢ Build your own Rate Limiter - https://lnkd.in/e2C2RB4M⇢ Build your own Message Broker - https://lnkd.in/eaFGTxKT⇢ Build your own Web Server - https://lnkd.in/ezBDppnb⇢ Build your own Memcached server - https://lnkd.in/esGquJTy⇢ Build your own IRC client - https://lnkd.in/eqWfX_JR⇢ Build your own Discord Bot - https://lnkd.in/emAymj8b⇢ Build your own compression tool using Huffman encoding - https://lnkd.in/e4WcUyYy⇢ Build your own Spotify client - https://lnkd.in/eGDB9zgN⇢ Build your own JSON parser - https://lnkd.in/ejWVe4H6People are solving the challenges in JavaScript/TypeScript, Rust, Clojure, Ruby, Python, C, C#, C++, Java, Go and Dart.If you fancy giving them a go, you can click on any of the links above or to get future challenges sent directly to you, you can subscribe to the Coding Challenges newsletter here: https://lnkd.in/e4S487pPTomorrow I'll be publishing the next challenge, Build your own curl.\n\n", "\n\n\n \"AI Would Make People Trust Their Dentist More, New Survey Shows.\"While many consumers still don’t trust AI in hashtag#healthcare – our recent survey suggests the majority would *love* to see it used in dentistry. In her Forbes article, Deb Gordon features survey findings and commentary from VideaHealth founder and CEO, Florian Hillen, addressing how hashtag#AI would be the key to getting consumers to take better care of their oral health. \"Hillen said that today, dentists are driving the adoption of AI tools, with many if not most already using some form of AI in their practice. But soon he believes patients will start asking for—and demanding—the use of dental AI. Within two to three years, he expects AI will become the standard of care.\" hashtag#DentalAI hashtag#videaai hashtag#videahealthhttps://lnkd.in/evya7xsD\n\n", "\n\n\n Should AI models sleep like humans do? Sleeping consolidates and abstracts memory from hippocampus and moves them to long term memory in neocortex. This creates room for new experiences and learning. This process prevents forgetting the old when we learn  something new and enables  us to be life long learners.Deep Learning models have a well known problem called “catastrophic forgetting”. In our pursuit to make a model more generalized when new similar task is trained the model tends to forget the old task it was already trained onNow researchers, taking inspiration from from the brain have come with a biologically inspired spiking neural network that simulates sleep. For us during sleep memory consolidation consists of replaying the short term memory with some noise so that it can be abstracted, consolidated and stored in the long term memory. That’s exactly what they did. They had a rapidly alternating periods of training and sleeping for the first task while the second task was being learnt.hashtag#ai hashtag#deeplearning hashtag#forgetting hashtag#sleep hashtag#memory hashtag#learning hashtag#spiking hashtag#neuron hashtag#neocortex hashtag#hippocampus hashtag#neuroscience\n\n", "\n\n\n 🔥Hot off the presses🔥 Laurie Voss's latest talk: a deep dive into retrieval-augmented generation, a code-level tutorial covering 7 advanced querying & retrieval techniques:⭐️ SubQuestionQueryEngine for complex questions⭐️ Small-to-big retrieval for improved precision⭐️ Metadata filtering, also for improved precision⭐️ Hybrid search including traditional search engine techniques⭐️ Recursive Retrieval for complex documents⭐️ Text to SQL⭐️ Multi-document agents that can combine all of these techniquesVideo: https://lnkd.in/dXSU-EMNAnd you can follow along with the slides here: https://lnkd.in/dDYQ9Qsj\n\n", "\n\n\n 🌟 Insights from \"Financial Machine Learning\" by Bryan Kelly and Dacheng Xi🌟🔍 Key Takeaways:💹 Understanding Asset Prices: Prices as predictions, reflecting future payoffs and investor valuations.📊 Large Information Sets: The vast scope of information influencing market prices, highlighting the need for complex models.🤔 Ambiguity in Functional Forms: Traditional econometrics vs. machine learning in financial markets.🤖 Machine Learning vs. Econometrics: Blurring lines between these fields with advanced prediction models.📈 Return Prediction: Evaluating different models including linear, penalized linear, decision trees, and neural networks.🏦 Risk-Return Tradeoffs: Exploring complex factor models and their implications in finance.💰 Optimal Portfolios: The shift from simple models to integrated estimation and optimization using machine learning.🚀 Future Directions: Recommendations for applying machine learning in financial contexts.📚 Fascinating Read!hashtag#MachineLearning hashtag#Finance hashtag#AssetPricing hashtag#PredictiveModels hashtag#RiskManagement hashtag#PortfolioOptimization hashtag#FinancialMarkets hashtag#Econometrics hashtag#DataScience hashtag#InnovationInFinance\n\n"]}